Public Member Functions | Friends | List of all members
IFCAPI::v1::PropertyEnumeratedValue Class Referencefinal
IFC Data Access
Represents an IfcPropertyEnumeratedValue. More...
#include <IFCProperty.hpp>
 Inheritance diagram for IFCAPI::v1::PropertyEnumeratedValue:
 Public Member Functions
std::vector< IFCAPI::Value >  | GetEnumerationValues () const
Get list of property values of the enumeration.
std::vector< IFCAPI::Value >  | GetEnumerationReference () const
Get list of property values of the enumeration reference.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Property
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Represents an IfcPropertyEnumeratedValue.
Since
Archicad 28